#include<iostream>
using namespace std;
int main() {
	typedef unsigned int ui;

	//正数：原码=反码=补码
	//负数：原码
	//      反码：除了符号位按位取反
	//      补码：反码+1


	//位运算

	// & 按位与（同1得1，有0则0）
	ui a = 60, b = 13;
	ui ans1 = a & b;
	//a：    0011 1100  
	//b：   &0000 1101
	//ans:   0000 1100 ->12
	cout << ans1 << endl;

	// |按位或（同0得0，有1则1）
	ui ans2 = a | b;
	//a：    0011 1100  
	//b：   |0000 1101
	//ans:   0011 1101 -> 61
	cout << ans2 << endl;

	// ^按位异或（相同为0，不同为1）
	ui ans3 = a ^ b;
	//a：    0011 1100  
	//b：   ^0000 1101
	//ans:   0011 0001 -> 49
	cout << ans3 << endl;

	// ~按位取反（用补码算）
	int ans4 = ~a;
	//a：    0000 0000 0011 1100  
	//~a：   1111 1111 1100 0011  （下一步将这个2进制补码翻译成十进制负数）
	//原码： 1000 0000 0011 1101 -> -61
	ui  ans5 = ~a;                  //（无符号数则输出超大正数）
	cout << ans4 << " " << ans5 << endl;

	// >>右移运算符（整体向右移动，左补符号位。右移除以2）
	// a：   0000 0000 0011 1100
	//a>>1： 0000 0000 0001 1110 -> 30
	cout << (a >> 1) << endl;
	int c = -60;
	//c：    1000 0000 0011 1100
	//补码： 1111 1111 1100 0100  （计算机里存的都是补码）
	//c>>1： 1111 1111 1110 0010  
	//原码： 1000 0000 0001 1110 -> -30
	cout << (c >> 1) << endl;

	// <<左移运算符（整体向左移动，右补0.左移乘2）
	// a：   0000 0000 0011 1100
	//a<<1： 0000 0000 0111 1000 -> 120
	cout << (a << 1) << endl;
	//c：    1000 0000 0011 1100
	//补码： 1111 1111 1100 0100  
	//c<<1： 1111 1111 1000 1000  
	//原码： 1000 0000 0111 1000 -> -120
	cout << (c << 1) << endl;
	return 0;
}
